In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'city':['Mumbai','Bangaluru','Delhi','Hyderabad','kolkatta','Chennai'],
                  'Humidity':['32',np.nan,'39','40','42',np.nan],
                  'Temprature':['30','34',np.nan,'44','43',np.nan]})
df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru      NaN         34
2      Delhi       39        NaN
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai      NaN        NaN

In [3]:
df.columns

Index(['city', 'Humidity', 'Temprature'], dtype='object')

In [4]:
df.isnull()   # True for NaN and false for other than NaN

    city  Humidity  Temprature
0  False     False       False
1  False      True       False
2  False     False        True
3  False     False       False
4  False     False       False
5  False      True        True

In [5]:
# inverse of isnull()  method
df.notnull()   # False for NaN and True for other

   city  Humidity  Temprature
0  True      True        True
1  True     False        True
2  True      True       False
3  True      True        True
4  True      True        True
5  True     False       False

In [5]:
#  on all values in city
df['Humidity'].value_counts()

40    1
39    1
32    1
42    1
Name: Humidity, dtype: int64

In [6]:
df['Humidity'].value_counts(dropna=False)

NaN    2
40     1
39     1
32     1
42     1
Name: Humidity, dtype: int64

In [7]:
df.isnull().sum()   #to Know about missing values across all Columns

city          0
Humidity      2
Temprature    2
dtype: int64

In [8]:
df[df['Humidity'].isnull()]

        city Humidity Temprature
1  Bangaluru      NaN         34
5    Chennai      NaN        NaN

In [9]:
df[df['Temprature'].isnull()]

      city Humidity Temprature
2    Delhi       39        NaN
5  Chennai      NaN        NaN

## dropna( )

In [10]:
dfany=df.dropna(how='any')
dfany

        city Humidity Temprature
0     Mumbai       32         30
3  Hyderabad       40         44
4   kolkatta       42         43

In [11]:
dfall=df.dropna(how='all')
dfall

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru      NaN         34
2      Delhi       39        NaN
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai      NaN        NaN

In [12]:
dfsubset=df.dropna(subset=['Humidity','Temprature'],how='all')
dfsubset

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru      NaN         34
2      Delhi       39        NaN
3  Hyderabad       40         44
4   kolkatta       42         43

## Fillna()

In [13]:
df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru      NaN         34
2      Delhi       39        NaN
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai      NaN        NaN

In [14]:
new_df=df.fillna(value=0)  # or directly can specify 0 as an argument
new_df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru        0         34
2      Delhi       39          0
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai        0          0

In [15]:
new_df=df.fillna({'Humidity':10,
                   'Temprature':20})
new_df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru       10         34
2      Delhi       39         20
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai       10         20

In [16]:
new_df=df.fillna(method='ffill')
new_df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru       32         34
2      Delhi       39         34
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai       42         43

In [17]:
new_df=df.fillna(method='bfill')
new_df

        city Humidity Temprature
0     Mumbai       32         30
1  Bangaluru       39         34
2      Delhi       39         44
3  Hyderabad       40         44
4   kolkatta       42         43
5    Chennai      NaN        NaN

In [18]:
new_df=df.fillna(method='ffill',axis='columns') #Horizanat assignment
new_df

        city   Humidity Temprature
0     Mumbai         32         30
1  Bangaluru  Bangaluru         34
2      Delhi         39         39
3  Hyderabad         40         44
4   kolkatta         42         43
5    Chennai    Chennai    Chennai